#include <stdio.h>
int main(){
    int a_1, a_2, b_1, b_2, sum1, sum2;
    printf("δωσε μου δύο αριθμούς από το 1 έως το 6 που αντιστοιχουν στα ζάρια του πρώτου παίκτη:");
    scanf("%d %d", &a_1, &a_2);
    sum1=a_1 + a_2;
    printf("το άθροισμα των ζαριών του πρώτου παίκτη είναι %d\n", sum1);
    printf("δωσε μου δύο αριθμούς από το 1 έως το 6 που αντιστοιχουν στα ζάρια του δεύτερου παίκτη:");
    scanf("%d %d", &b_1, &b_2);
    sum2= b_1 + b_2;
    printf("το άθροισμα των ζαριών του δεύτερου παίκτη είναι %d\n", sum2);
    if(sum1>sum2){
        printf("ο πρώτος παίκτης νίκησε");
    }
    else if(sum1<sum2){
        printf("ο δεύτερος παίκτης νίκησε");
    }
    else{
        printf("ισοπαλία");
    }
    return 0;
}